#include <stdio.h>
/*----------------------------------
数据类型	占用空间	有效数字范围
float	    4字节	  7位有效数字
double	    8字节	  15～16位有效数字
------------------------------------
由于浮点型变量是由有限的存储单元组成的，因此只能提供有限的有效数字。在
有效位以外的数字将被舍去，这样可能会产生一些误差。
不以f结尾的常量是double类型，以f结尾的常量(如下面代码中的3.14f)是float类型
*/

int main()
{
	//传统方式赋值
	float a = 3.14f; //或3.14F
	double b = 3.14;

	printf("a = %f\n", a);
	printf("b = %lf\n", b);

	//科学法赋值
	a = 3.2e3f; //3.2*1000 = 32000，e可以写E
	printf("a1 = %f\n", a);

	a = 100e-3f; //100*0.001 = 0.1
	printf("a2 = %f\n", a);

	a = 3.1415926f;
	printf("a3 = %f\n", a); //结果为3.141593

	return 0;
}