#include<stdio.h>
#include<stdlib.h>

/*a[][]二维数组是按行进行存放的，先存放a[0]行，再存放a[1]行、a[2]行，
并且每行有四个元素，也是依次存放的。

二维数组在概念上是二维的：其下标在两个方向上变化，对其访问一般需要两个下标。
在内存中并不存在二维数组，二维数组实际的硬件存储器是连续编址的，
也就是说内存中只有一维数组，即放完一行之后顺次放入第二行，和一维数组存放方式是一样的。
*/

int main(){
	//定义了一个二维数组，名字叫a
	//由3个一维数组组成，这个一维数组是int [4]
	//这3个一维数组的数组名分别为a[0],a[1],a[2]
	int a[3][4];

	a[0][0] = 0;
	//……
	a[2][3] = 12;

	//给数组每个元素赋值
	int i = 0;
	int j = 0;
	int num = 0;
	for (i = 0; i < 3; i++)
	{
		for (j = 0; j < 4; j++)
		{
			a[i][j] = num++;
		}
	}

	//遍历数组，并输出每个成员的值
	for (i = 0; i < 3; i++)
	{
		for (j = 0; j < 4; j++)
		{
			printf("%d, ", a[i][j]);
		}
		printf("\n");
	}


    //分段赋值 	int a[3][4] = {{ 1, 2, 3, 4 },{ 5, 6, 7, 8, },{ 9, 10, 11, 12 }};
	int a0[3][4] = 
	{ 
		{ 1, 2, 3, 4 },
		{ 5, 6, 7, 8, },
		{ 9, 10, 11, 12 }
	};

	//连续赋值
	int a1[3][4] = { 1, 2, 3, 4 , 5, 6, 7, 8, 9, 10, 11, 12  };

	//可以只给部分元素赋初值，未初始化则为0
	int a2[3][4] = { 1, 2, 3, 4  };

	//所有的成员都设置为0
	int a3[3][4] = {0};

	//[]中不定义元素个数，定义时必须初始化
	int a4[][4] = { 1, 2, 3, 4, 5, 6, 7, 8};

    //---------------------------------------------------------
    int a5[3][4] = { 1, 2, 3, 4 , 5, 6, 7, 8, 9, 10, 11, 12  };
    //数组名为数组首元素地址，二维数组的第0个元素为一维数组
	//第0个一维数组的数组名为a[0]
	printf("a5 = %p\n", a5);
	printf("a5[0] = %p\n", a5[0]);
	
	//测二维数组所占内存空间，有3个一维数组，每个一维数组的空间为4*4
	//sizeof(a) = 3 * 4 * 4 = 48
	printf("sizeof(a5) = %d\n", sizeof(a5));

	//测第0个元素所占内存空间，a[0]为第0个一维数组int[4]的数组名，4*4=16
	printf("sizeof(a5[0]) = %d\n", sizeof(a5[0]) );

	//测第0行0列元素所占内存空间，第0行0列元素为一个int类型，4字节
	printf("sizeof(a5[0][0]) = %d\n", sizeof(a5[0][0]));

	//求二维数组行数
	printf("i = %d\n", sizeof(a5) / sizeof(a5[0]));

	// 求二维数组列数
	printf("j = %d\n", sizeof(a5[0]) / sizeof(a5[0][0]));

	//求二维数组行*列总数
	printf("n = %d\n", sizeof(a5) / sizeof(a5[0][0]));



}